/*********************************************************************************************************
* 模块名称:Alarm.c
* 摘    要: 闹钟实现文件
* 当前版本: 1.0.0
* 作    者: 风信子
* 完成日期: 2025年07月24日
* 内    容: 功能包括闹钟初始化、设置闹钟时间、检查闹钟是否触发、保存和加载闹钟状态
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/

#define _CRT_SECURE_NO_WARNINGS
#include "Alarm.h"
#include <stdio.h>
#include <stdlib.h>

/*********************************************************************************************************
* 函数名称: IninAlarm()
* 函数功能: 初始化闹钟
* 输入参数: Alarm* alarm
* 返 回 值: void
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/

//三个函数  初始化 设定时间 判断是否在有效，响铃
void IninAlarm(Alarm* alarm)
{
  alarm->hour = 0;
  alarm->min  = 0;
  alarm->is_available  = 0;   //默认关闭
};
/*********************************************************************************************************
* 函数名称: SetTime(Alarm* alarm, int h, int m)
* 函数功能: 设置闹钟时间
* 输入参数: Alarm* alarm, int h, int m
* 返 回 值: void
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/

void SetTime(Alarm* alarm, int h, int m)
{
  if ((h>=0&&h<=23)&&(m>=0&&m<=60))
  {
    alarm->is_available = 1;
    alarm->hour   = h;
    alarm->min    = m;
  }
};

/*********************************************************************************************************
* 函数名称: CheckAlarm(Alarm* alarm, int Current_Hour, int Current_Min)
* 函数功能: 检查闹钟是否触发
* 输入参数: Alarm* alarm, int Current_Hour, int Current_Min
* 返 回 值: int
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/

int CheckAlarm(Alarm* alarm, int Current_Hour, int Current_Min)
{
  if (alarm->is_available == 1)
  {
    if ((alarm->hour == Current_Hour) && (alarm->min == Current_Min))
    {
      
        return 1;           //闹钟触发
    }
  }
  return 0;
}
/*********************************************************************************************************
* 函数名称: SaveAlarm(Alarm* alarm, const char* filename)
* 函数功能: 保存闹钟到文件
* 输入参数: Alarm* alarm, const char* filename
* 返 回 值: void
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/

//保存闹钟到文件
void SaveAlarm(Alarm* alarm, const char* filename)
{
  FILE* file = fopen(filename, "w");    //写的模式
  if (file != NULL)
  {
    fprintf(file, "%d, %d, %d\n", alarm->hour, alarm->min, alarm->is_available);
    fclose(file);              // 相当于给文件关门

  }
  else
  {
    printf("保存失败\n");
  }
}

/*********************************************************************************************************
* 函数名称: LoadAlarm(Alarm* alarm, const char* filename)
* 函数功能: 读取闹钟文件，如果文件不存在则初始化闹钟
* 输入参数: Alarm* alarm
* 返 回 值: void
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/

void LoadAlarm(Alarm* alarm, const char* filename)
{
  FILE* file = fopen(filename, "r");
  if (file != NULL)
  {
    fscanf_s(file, "%d,%d,%d", &alarm->hour, &alarm->min, &alarm->is_available);  // 从文件中读取
  }
  else
  {
    IninAlarm(alarm);
  }
}

