/*********************************************************************************************************
* 模块名称: GteTime.c
* 摘    要: 获取当前时间的函数
* 当前版本: 1.0.0
* 作    者: 风信子
* 完成日期: 2025年07月24日
* 内    容: 功能包括时钟模块初始化、2ms计数、暂停或启动时钟、获取与设置时间值、显示当前时间
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include "DataType.h"
#include "Gettime.h"

/*********************************************************************************************************
* 函数名称: Gettime()
* 函数功能: 获取1970年1月1日0时0分0秒到现在的秒数，并拆包为年月日时分秒
* 输入参数: void
* 返 回 值: void
* 创建日期: 2025年07月24日
* 注    意:
*********************************************************************************************************/
//结构体，用来存放拆包后月日时分秒
struct tm* Gettime()      //获取当前时间的函数 struct tm*为固定的使用格式
{
  time_t NowTime;         //time_t为时间戳类型，存放从1970年1月1日0时0分0秒到现在的秒数
  time(&NowTime);
  //printf("进货成功时间为:%d\n", NowTime);
  static struct tm timeinfo;
  localtime_s(&timeinfo, &NowTime);  //第一个是容器地址，第二个是时间戳地址
  return &timeinfo;

};